
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ShotaTakayama/aws-ecs-terraform/actions/runs/5346556500)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00cd9ad0b470092e0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0be02ca0769426113]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b8965b27aeaea56b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-009637ee9fab801b5]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d6459ef7d1d67a60]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07802214fac513794]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0702615a6ac281046]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-036bc96b487cb0e81]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0e439f10f125a1664]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09f90e54f8f22418f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cc8ac56822eba90b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dafa2a8668b8c4ca]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05beb4e9c1c31ad28]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a54a13632a869962]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0702615a6ac2810461080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030afd5026a95c533]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0dd2e5dd95765208b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02148733d699d4c19]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b46d08c692da6f4b]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-084768b7929ad6987]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-02ca9b8628c492134]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0be02ca07694261131080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-009637ee9fab801b51080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-00cd9ad0b470092e0"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-00cd9ad0b470092e0"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 3s [id=sg-0d081b689ee7e0836]
aws_security_group.alb: Creation complete after 3s [id=sg-030bffab5bae97658]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-4034492785]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"265cb7640488c94ee46de1c14e80654669789f18","Vars":{},"WorkflowName":"Terraform"} -->